name: "VisualNet"

input: "VisualNet_data"
input_dim: 2
input_dim: 3
input_dim: 512
input_dim: 512

input: "VisualNet_label"
input_dim: 2
input_dim: 1
input_dim: 10
input_dim: 10

layer {
  name: "VisualNet_conv1"
  type: "Convolution"
  bottom: "VisualNet_data"
  top: "VisualNet_conv1"
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
  }
}
layer {
  name: "VisualNet_relu1"
  type: "ReLU"
  bottom: "VisualNet_conv1"
  top: "VisualNet_conv1"
}
layer {
  name: "VisualNet_pool1"
  type: "Pooling"
  bottom: "VisualNet_conv1"
  top: "VisualNet_pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "VisualNet_norm1"
  type: "LRN"
  bottom: "VisualNet_pool1"
  top: "VisualNet_norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "VisualNet_conv2"
  type: "Convolution"
  bottom: "VisualNet_norm1"
  top: "VisualNet_conv2"
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
  }
}
layer {
  name: "VisualNet_relu2"
  type: "ReLU"
  bottom: "VisualNet_conv2"
  top: "VisualNet_conv2"
}
layer {
  name: "VisualNet_pool2"
  type: "Pooling"
  bottom: "VisualNet_conv2"
  top: "VisualNet_pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "VisualNet_norm2"
  type: "LRN"
  bottom: "VisualNet_pool2"
  top: "VisualNet_norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "VisualNet_conv3"
  type: "Convolution"
  bottom: "VisualNet_norm2"
  top: "VisualNet_conv3"
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "VisualNet_relu3"
  type: "ReLU"
  bottom: "VisualNet_conv3"
  top: "VisualNet_conv3"
}
layer {
  name: "VisualNet_conv4"
  type: "Convolution"
  bottom: "VisualNet_conv3"
  top: "VisualNet_conv4"
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
  }
}
layer {
  name: "VisualNet_relu4"
  type: "ReLU"
  bottom: "VisualNet_conv4"
  top: "VisualNet_conv4"
}
layer {
  name: "VisualNet_conv5"
  type: "Convolution"
  bottom: "VisualNet_conv4"
  top: "VisualNet_conv5"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
  }
}
layer {
  name: "VisualNet_relu5"
  type: "ReLU"
  bottom: "VisualNet_conv5"
  top: "VisualNet_conv5"
}
layer {
  name: "VisualNet_pool5"
  type: "Pooling"
  bottom: "VisualNet_conv5"
  top: "VisualNet_pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "VisualNet_fc6-c"
  type: "Convolution"
  bottom: "VisualNet_pool5"
  top: "VisualNet_fc6"
  convolution_param {
    num_output: 300
    kernel_size: 6
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "VisualNet_relu6"
  type: "ReLU"
  bottom: "VisualNet_fc6"
  top: "VisualNet_fc6"
}
layer {
  name: "VisualNet_drop6"
  type: "Dropout"
  bottom: "VisualNet_fc6"
  top: "VisualNet_fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "VisualNet_fc7-c"
  type: "Convolution"
  bottom: "VisualNet_fc6"
  top: "VisualNet_fc7"
  convolution_param {
    num_output: 250  #should be 250 which is consistent to HapticNet (rather 300)
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "VisualNet_relu7"
  type: "ReLU"
  bottom: "VisualNet_fc7"
  top: "VisualNet_fc7"
}
layer {
  name: "VisualNet_drop7"
  type: "Dropout"
  bottom: "VisualNet_fc7"
  top: "VisualNet_fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "VisualNet_fc8-c"
  type: "Convolution"
  bottom: "VisualNet_fc7"
  top: "VisualNet_fc8"
  convolution_param {
    num_output: 69
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "VisualNet_loss"
  type: "SoftmaxWithLoss"
  bottom: "VisualNet_fc8"
  bottom: "VisualNet_label"
  top: "VisualNet_loss"
  loss_param { 
    #ignore_label: -1
    normalize: false 
  }
  include {
    phase: TRAIN
  }
}
